DROP_WEDGE_phi4545/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 1;
scale 1;

vertices
(
    (0 0 0) //0
    (0.004144 0 0) //1
    (0.018 0.013856 0) //2
    (0.0318456 0 0) //3
    (0.036 0 0) //4
    (0.036 0.036 0) //5
    (0.03184 0.036 0) //6
    (0.018 0.036 0) //7
    (0.004144 0.036 0) //8
    (0 0.036 0) //9

    (0 0 0.036) //10
    (0.004144 0 0.036) //11
    (0.018 0.013856 0.036) //12
    (0.0318456 0 0.036) //13
    (0.036 0 0.036) //14
    (0.036 0.036 0.036) //15
    (0.03184 0.036 0.036) //16
    (0.018 0.036 0.036) //17
    (0.004144 0.036 0.036) //18
    (0 0.036 0.036) //19
);

blocks
(
    hex (0 10 11 1 9 19 18 8) (100 100 100) simpleGrading (1 1 1)
    hex (1 11 12 2 8 18 17 7) (100 100 100) simpleGrading (1 1 1)
    hex (2 12 13 3 7 17 16 6) (100 100 100) simpleGrading (1 1 1)
    hex (3 13 14 4 6 16 15 5) (100 100 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type wall;
        faces
        (
            (0 10 11 1)
            (1 11 12 2)
            (2 12 13 3)
            (3 13 14 4)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (9 8 18 19)
            (8 7 17 18)
            (7 6 16 17)
            (6 5 15 16)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 10 19 9)
            (4 14 15 5)
        );
    }
    frontAndBack
    {
        type wall;
        faces
        (
            (0 1 8 9)
            (10 19 18 11)

            (1 2 7 8)
            (11 18 17 12)

            (2 3 6 7)
            (12 17 16 13)

            (3 4 5 6)
            (13 16 15 14)
        );
    }
);
    


mergePatchPairs
(
);

// ************************************************************************* //
