DROP_WEDGE_phi4545/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    sphereToCell
    {
         centre (0.018 0.0153 0.018); 
           radius 0.0014 ;
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volVectorFieldValue U ( 0 -0.5 0)
        );
    }
      
                                                       
   
 
);


// ************************************************************************* //
